# ElementIntersectsSolidFilter Constructor (Solid, Boolean)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementIntersectsSolidFilter Constructor (Solid, Boolean)
ElementIntersectsSolidFilter Class See Also
---
Constructs a filter to match elements which intersect the given element, with the option to match all elements not intersecting the given element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementIntersectsSolidFilter(
	Solid solid,
	bool inverted
)
```

Visual Basic
---
```text
Public Sub New ( _
	solid As Solid, _
	inverted As Boolean _
)
```

Visual C++
---
```text
public:
ElementIntersectsSolidFilter(
	Solid^ solid,
	bool inverted
)
```

# ### Parameters
solid
    Type: Autodesk.Revit.DB..::..Solid The solid geometry to check for intersection.
inverted
    Type: System..::..Boolean True if the filter should match all elements which do not intersect the given element.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ElementIntersectsSolidFilter Class
ElementIntersectsSolidFilter Overload
Autodesk.Revit.DB Namespace